/*
    바킹독님 알고리즘 강의 중 수학 단원

    코딩테스트에서 수학이라는 문제 유형으로 분류되는 유형은 보통
    중학교 수학 수준에서 해결되는 개념들을 필요로 한다

    또한 구현력 또는 설계 능력을 확인하기에는 조금 적절치 않아 거의 출제되지는 않는다

    #소수
    - primetut.kt 

    #최대공약수
    - gcdtut.kt

    #이항계수
    - 순열
    : 색깔이 다른 공 n개중에 k를 선택할때 순서를 고려하여 뽑는것
    : nCk = n! / (n-k)! * k!
    => 5개에서 3개를 뽑는것
    => 5! / (3!*2!) = 120/12 = 10 

    - 조합
    : 색깔이 다른 공 n개중에 k를 선택할때 순서를 고려하지 않고 뽑는것
    : nPk = n! / (n-k)!
    => 5개에서 3개를 뽑는것
    => 5! / 2! = 120/2 = 60

    이항계수 연습문제
    1. 백준 11050(solve)
    - 다짜고짜 이항계수를 구하라하네?
    - b가 n개 있을 때 이들중에 r개를 뽑는다는 것 => 이게 이항계수
    - 순서를 고려하여 뽑는것인듯?

    2. 백준 11051(solve)

*/

