/*
    바킹독님 강의 중 백트래킹 단원
    https://blog.encrypted.gg/919

    모든 경우의 수를 탐색, 가망없는 루트를 제거

    결국, 가능한 경우의 수에 따라 상태공간트리를 생성하는과정인거같은데

    백트래킹이랑 해당 트리를 dfs순회 하는것과 같고

    맞나?


    ============= 바킹독님 강의에 제시된 연습문제 =============
    1. 백준 15649(solve)
    - N과M(1) 만 제시했지만, 나머지 시리즈를 모두 풀어보는것으르 추천하였기에 모두 풀어봐야겠다
    2. 백준 15650(solve)
    3. 백준 15651(solve)
    4. 백준 15652(solve)

    5. 백준 9663(solve)
    6. 백준 1182(solve)

    
    ============= 네이버 카페 문제50선 중 백트래킹 + 완전탐색 유형 =============
    1. 백준 10819(solve)
    2. 백준 2798(solve)
    3. 백준 14889(solve)
    4. 백준 2661(solve)
    5. 백준 14888(solve)
    6. 백준 15684(solve)

*/