/*
    2022 카카오 인턴십
    
    1. solve

    2. solve

    3.

    4. 아예 공부 못한 알고리즘

    5. 0.5 solve

    시간복잡도가 10^8 로 넘어가면 시간 초과가 납니다.
    출처: https://sesang06.tistory.com/199 [세상 끝 조그만 서가]

    1. 오타로 인해서 시간이 좀 낭비되었다
    2. 금방 풀었는데 2개 tc에 대한 시간초과가 잡히지 않는다
    - 투포인터로 접근해보았고 성공 
    3. 어떤방식으로 풀어야하는지 감이 안온다. 내가 공부했던 알고리즘이나, 비슷한 유형을 풀어봤던거라면 놀라울듯
    4. 그래프 간선 가중치 부여된 문제. 해당 알고리즘 공부를 해야겠다
    5. 정확성만 통과하자 하고 바로 진행해서 통과, 효율성은 어떤 방식을 해야하는지 모르겠다
    - 연속된 rotate를 한번에 처리? 
    - rotate(n : Int) 이런식으로?
    - shiftRow(n : Int)
*/


/*
    3번 저는 reward/cost로 효율성 구해서 전체효율성, alp효율성, cop효율성 3개로 그리디써봤는데 60%정도만 맞더라고요
    3번 dp
    우선순위 큐 bfs
*/
/*

    4번 : 백트래킹 + dp

*/