// silver 1
// 10-3
import java.io.*
fun main(args : Array<String>){
    val bw = BufferedWriter(OutputStreamWriter(System.out))
    val br = BufferedReader(InputStreamReader(System.`in`))

    val n = br.readLine().toInt()

    star(n, bw)

    bw.flush()
    bw.close()
    br.close()
}

/*
    n 이 3일때
    (1,1), (1,4), (1,7) 마다 빈칸
    (4,1), (4,4), (4,7)

    x%3 == 1 && y%3 == 1 이면 빈칸

    n 이 9일때
    (3,3), (3,4), (3,5)
    (4,3), (4,4), (4,5)
    (5,3), (5,4), (5,5)
    => 3칸을 1칸이라고 가정한다면 
    n이 3일때와 조건이 같다
    => (x/3) % 3 == 1 && (y/3) % 3 == 1

    n이 27일때
    => 9칸을 1칸이라고 가정한다면
    n이 3일때와 조건이 같다
    => (x/9) % 3 == 1 && (y/9) % 3 == 1

    n이 3일때 1, n이 9일때 3, n이 27일때 9
    n/3이 재귀의 힌트
    n/3이 1이 되면 재귀 종료
*/

fun star(n : Int, bw : BufferedWriter){
    val size = n
    val r = size / n
    for(x in 0 until size){
        for(y in 0 until size){
            if((x/r)%3 == 1 && (y/r)%3 == 1){
                bw.write(" ")
            }else{
                if(n/3 == 1){
                    bw.write("*")
                }else{
                    star(n/3, bw)
                }
            }
        }
    }
    bw.write("\n")
}

// 여기 아래는 자료보면서 공부




// private fun start(x : Int, y : Int, bw : BufferedWriter){
//     if(x%3 ==1 && y%3 == 1){
//         bw.write(" ")
//     }else if((x/3)%3 == 1 && (y/3)%3 == 1)
//         bw.write(" ")
//     else if((x/9)%3 == 1 && (y/9)%3 == 1)
//         bw.write(" ")
//         else{
//         bw.write("*")
//     }
// }

private fun drawStar(n : Int, bw : BufferedWriter){
    for(i in 0 until n){
        for(j in 0 until n){
            star(i, j, n, bw)
        }
        bw.write("\n")
    }
}

// //https://velog.io/@sossont/%EB%B0%B1%EC%A4%80-2447%EB%B2%88-%EB%B3%84-%EC%B0%8D%EA%B8%B0-10
private fun star(x : Int, y : Int, n : Int, bw : BufferedWriter){
    if((x/n)%3 ==1 && (y/n)%3 == 1){
        bw.write(" ")
    }else{
        if(n/3==0){
            bw.write("*")
        }else{
            star(x, y, n/3, bw)
        }
    }
}


/*
    (x/n)%3 == 1 && (y/n)%3 == 1
    n = size / 3

    27 -> 9 -> 3
*/

/*
    ***
    * *
    ***
    -> (1,1) 좌표가 비어있다
    ********* 
    * ** ** *
    *********
    -> (1,1), (1,4), (1,7)
    => y%3 == 1 일때 빈좌표

***************************
* ** ** ** ** ** ** ** ** *
***************************
***   ******   ******   ***
* *   * ** *   * ** *   * *
***   ******   ******   ***
***************************
* ** ** ** ** ** ** ** ** *
***************************
(3,3), (3,4), (3,5)
(4,3), (4,4), (4,5)
(5,3), (5,4), (5,5)
=> 기본모형 
*** 가 나오고 공백
* *
***
9일때 3,4,5
(n/3) % 3 == 1

***************************
* ** ** ** ** ** ** ** ** *
***************************
***   ******   ******   ***
* *   * ** *   * ** *   * *
***   ******   ******   ***
***************************
* ** ** ** ** ** ** ** ** *
***************************
*********         *********
* ** ** *         * ** ** *
*********         *********
***   ***         ***   ***
* *   * *         * *   * *
***   ***         ***   ***
*********         *********
* ** ** *         * ** ** *
*********         *********
***************************
* ** ** ** ** ** ** ** ** *
***************************
***   ******   ******   ***
* *   * ** *   * ** *   * *
***   ******   ******   ***
***************************
* ** ** ** ** ** ** ** ** *
***************************
*/